EDT/УТ/src/Catalogs/новаСтатьиДоходовРасходов/новаСтатьиДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаСтатьиДоходовРасходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Доходы</name>
      <description>Доходы</description>
    </items>
    <items>
      <name>Расходы</name>
      <description>Расходы</description>
    </items>
  </predefined>
  <attributes>
    <name>Доход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики</name>
    <type>
      <types>EnumRef.новаВидыАналитикСтатейДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияПоУмолчанию</name>
    <type>
      <types>EnumRef.новаСпособыРаспределения</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.новаВалюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаСтатьиДоходовРасходов/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Ссылка = Справочники.новаСтатьиДоходовРасходов.Доходы Тогда
		Доход = Истина;
		Возврат;
		
	ИначеЕсли Ссылка = Справочники.новаСтатьиДоходовРасходов.Расходы Тогда
		Доход = Ложь;
		Возврат;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		Если Родитель.Доход <> Доход Тогда
			Родитель = ?(Доход, Справочники.новаСтатьиДоходовРасходов.Доходы, Справочники.новаСтатьиДоходовРасходов.Расходы);
		КонецЕсли;
	Иначе
		Родитель = ?(Доход, Справочники.новаСтатьиДоходовРасходов.Доходы, Справочники.новаСтатьиДоходовРасходов.Расходы);
	КонецЕсли;
КонецПроцедуры
